src/main/resources/xml/mtn-start-sms-notification.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1"
                  xmlns:loc="http://www.csapi.org/schema/parlayx/sms/notification_manager/v2_3/local">
    <soapenv:Header>
        <RequestSOAPHeader xmlns="http://www.huawei.com.cn/schema/common/v2_1">
            <spId>sp_id</spId>
            <spPassword>sp_password</spPassword>
            <serviceId>service_id</serviceId>
            <timeStamp>time_stamp</timeStamp>
        </RequestSOAPHeader>
    </soapenv:Header>
    <soapenv:Body>
        <loc:startSmsNotification>
            <loc:reference>
                <endpoint>notify_url</endpoint>
                <interfaceName>notifySmsReception</interfaceName>
                <correlator>correlator_ref</correlator>
            </loc:reference>
            <loc:smsServiceActivationNumber>service_activation_number</loc:smsServiceActivationNumber>
            <loc:criteria>subscribe</loc:criteria>
        </loc:startSmsNotification>
    </soapenv:Body>
</soapenv:Envelope>